errors_map = [
    'Не доступен термодатчик #1',
    'Не доступен термодатчик #2',
    'Не доступен термодатчик #3',
    'Не доступен термодатчик #4',
    'Температура воздуха на входе высока',
    'Температура воды на входе высока',
    'Температура воды на сбросе высока',
    'Температура рабочей части высока',
    'Давление воды низко',
    'Давление воздуха низко',
    'Невозможно снизить температуру охлаждающих сред (вода/воздух)',
    'Низкий расход охлаждающей воды',
    'Зонд не запаркован (необходимо проверить исправность зонда)',
    '',
    'Неисправность системы поворота',
    'Неисправность системы заслонки'
    ]

mods = [
    'Зонд в сети',
    'Продувка зонда',
    'Подготовка',
    'Зонд в работе',
    'Ошибка системы, работа остановлена',
    'Система остановлена штатно'
    ]

limit_switch = ['Зонд запаркован', 'Зонд в топке']

temperature_map = [
    'Температура воздуха',
    'Температура воды',
    'Температура воды на сбросе',
    'Температура рабочей части'
    ]

pressure_map = [
    'Давление воды',
    'Давление воздуха'
    ]

vlc_states = {
    0 : 'Idle / NothingSpecial → плеер создан, но ничего не воспроизводит.',
    1 : 'Opening → идёт открытие медиа (RTSP, файл, поток).',
    2 : 'Buffering → загрузка/буферизация данных.',
    3 : 'Playing → воспроизведение запущено.',
    4 : 'Paused → воспроизведение приостановлено.',
    5 : 'Stopped → воспроизведение остановлено (но медиа ещё может быть связано).',
    6 : 'Ended → воспроизведение дошло до конца.',
    7 : 'Error → произошла ошибка (например, файл не найден, разрыв RTSP).'
    }
