errors_map = [
    'Не доступен термодатчик #1',
    'Не доступен термодатчик #2',
    'Не доступен термодатчик #3',
    'Не доступен термодатчик #4',
    'Температура воздуха на входе высока',
    'Температура воды на входе высока',
    'Температура воды на сбросе высока',
    'Температура рабочей части высока',
    'Давления воды низко',
    'Давления воздуха низко',
    'Невозможно снизить температуру охлаждающих сред (вода/воздух)',
    'Низкий расход охлаждающей воды',
    'Зонд не запаркован (необходимо проверить исправность зонда)',
    '',
    'Неисправность системы поворота',
    'Неисправность системы заслонки'
    ]

mods = [
    'Зонд в сети',
    'Продувка зонда',
    'Подготовка',
    'Зонд в работе',
    'Ошибка системы, работа остановлена',
    'Система остановлена штатно'
    ]

limit_switch = ['Зонд запаркован', 'Зонд в топке']

temperature_map = [
    'Температура воздуха',
    'Температура воды',
    'Температура воды на сбросе',
    'Температура рабочей части'
    ]

pressure_map = [
    'Давление воды',
    'Давление воздуха'
    ]